// Задание 4.
// Реализуйте следующее консольное приложение подобно примеру, который разбирался в видео. 
// Реализуйте его на прототипах. Определите иерархию электроприборов. Включите некоторые в розетку. 
// Посчитайте потребляемую мощность (передайте аргумент). 
// Таких приборов должно быть как минимум два (например, настольная лампа и компьютер). Выбрав прибор,
//  подумайте, какими свойствами он обладает.
// План:
// Определите родительскую функцию с методами, которые включают/выключают прибор из розетки.
// Создайте делегирующую связь [[Prototype]] для двух конкретных приборов.
// У каждого из приборов должны быть собственные свойства и, желательно, методы, отличные от родительских методов.
// Создайте экземпляры каждого прибора.
// Выведите в консоль и посмотрите на результаты работы, можете гордиться собой :)
// Общие требования:
// Имена функций, свойств и методов должны быть информативными
// Соблюдайте best practices:
// использование camelCase нотации для переменных и методов, PascalCase для названия функций-конструкторов и классов;
// информативные имена (а не a, b);
// четкая связь между классом и его экземплярами (класс описывает множество, а экземпляр — конкретную реализацию);
// использование синтаксиса es6 (кроме функции-конструкторов) и так далее.
// Удачи!

let totalCons = 0; 

function Kitchendevs (name, consumption) {
    this.name = name,  
    this.consumption = consumption
}

const whashingMachine = new Kitchendevs ('Washing machine', 420);
const grillMachine = new Kitchendevs ('Grill machine', 1500);
const frige = new Kitchendevs ('Fridge', 500);


Kitchendevs.prototype.switchOn = function (position) {
    
    if ('on' === position) { console.log( this.name + ' включена ' + this.consumption + ' W'); 
    return totalCons += this.consumption; } 

    else if ('off' === position) {console.log( this.name + ' выключен/а'); 
    return totalCons;}
}

whashingMachine.switchOn('on');
grillMachine.switchOn('off');
frige.switchOn('on');
console.log('Общее потребление: '+ totalCons + ' W/h');



